Ninagawa123/Meridian_Dev/machiuke_mode_esp32/old/main.cpp
  /* Bluetoothのペアリング情報 */
  int bt_count = esp_bt_gap_get_bond_device_num();
  if (!bt_count)
  {
    Serial.println("No bonded BT device found.");
  }
  else
  {
    Serial.print("Bonded BT device count: ");
    Serial.println(bt_count);
    if (PAIR_MAX_DEVICES < bt_count)
    {
      bt_count = PAIR_MAX_DEVICES;
      Serial.print("Reset bonded device count: ");
      Serial.println(bt_count);
    }
    esp_err_t tError = esp_bt_gap_get_bond_device_list(&bt_count, pairedDeviceBtAddr);
    if (ESP_OK == tError)
    {
      for (int i = 0; i < bt_count; i++)
      {
        Serial.print("Found bonded BT device # ");
        Serial.print(i);
        Serial.print(" -> ");
        Serial.println(bda2str(pairedDeviceBtAddr[i], bda_str, 18));
        if (REMOVE_BONDED_DEVICES)
        {
          esp_err_t tError = esp_bt_gap_remove_bond_device(pairedDeviceBtAddr[i]);
          if (ESP_OK == tError)
          {
            Serial.print("Removed bonded BT device # ");
          }
          else
          {
            Serial.print("Failed to remove bonded BT device # ");
          }
          Serial.println(i);
        }
      }
    }
  }

  /* PS4コントローラの接続開始 */
  if (JOYPAD_MOUNT == 4)
  {
    PS4.begin(BT_MAC_ADDR); // ESP32のMACが入ります.PS4にも設定します.
    Serial.println("PS4 controller connecting...");
  }

  /* Wiiコントローラの接続開始 */
  if ((JOYPAD_MOUNT == 5) or (JOYPAD_MOUNT == 6))
  {
    wiimote.init();
    // wiimote.addFilter(ACTION_IGNORE, FILTER_NUNCHUK_ACCEL);
    Serial.println("Wiimote connecting...");
    joypad_search = 3;
  }

  /* SPI送受信用DMAの設定 */
  s_spi_meridim_dma = slave.allocDMABuffer(MSG_BUFF + 4); // DMAバッファ設定
  r_spi_meridim_dma = slave.allocDMABuffer(MSG_BUFF + 4); // DMAバッファ設定
  // DMAは高速な上, 一度に送受信できるデータ量を増やせる
  // バッファサイズは4で割り切れる必要があり, また末尾に4バイト分0が入る不具合があるので+4で対策

  /* SPI送受信バッファをリセット */
  memset(s_spi_meridim_dma, 0, MSG_BUFF + 4); // ※+4は不具合対策
  memset(r_spi_meridim_dma, 0, MSG_BUFF + 4); // ※+4は不具合対策

  /* SPI通信の初回送信データをセット */
  memset(s_spi_meridim.bval, 0, MSG_BUFF + 4);                                   // ※+4は不具合対策
  s_spi_meridim.sval[MSG_SIZE - 1] = checksum_val(s_spi_meridim.sval, MSG_SIZE); //データ末尾にチェックサムを入れる
  memcpy(s_spi_meridim_dma, s_spi_meridim.bval, MSG_BUFF + 4);                   // 送信データをDMAバッファに転記

  /* SPI通信の設定 */
  slave.setDataMode(SPI_MODE3);
  slave.setMaxTransferSize(MSG_BUFF + 4);
  slave.setDMAChannel(2); // 専用メモリの割り当て(1か2のみ)
  slave.setQueueSize(1);  // キューサイズ　とりあえず1
  slave.begin();          // 引数を指定しなければデフォルトのSPI（SPI2,HSPIを利用）ピン番号は CS: 15, CLK: 14, MOSI: 13, MISO: 12
  delay(100);             //この行は削除できそう

  /* スレッドの開始 */
  // マルチスレッドの宣言（無線系はすべてCORE0で動く.メインループはCORE1）
  //  xTaskCreatePinnedToCore(Core1_SPI, "Core1_SPI", 4096, NULL, 15, &thp[0], 1);
  //  xTaskCreatePinnedToCore(Core0_UDP, "Core0_UDP", 4096, NULL, 10, &thp[1], 0);
  xTaskCreatePinnedToCore(Core0_BT_r, "Core0_BT_r", 4096, NULL, 5, &thp[2], 0);
}

//================================================================================================================
//---- メ　イ　ン　ル　ー　プ-----------------------------------------------------------------------------------------
//================================================================================================================
void loop()
{

  //------------------------------------------------------------------------
  // [ 1 ]  S P I 送 受 信 の 実 行
  //------------------------------------------------------------------------

  // @[1-1] SPI通信のトランザクションがなければデータをキューに補充
  if (slave.remained() == 0)
  {
    if (spi_ready_flag) // SPI送信データの作成が完了しているか
    {
      flow_monitor("[1]"); // 動作チェック用シリアル表示
      slave.queue(r_spi_meridim_dma, s_spi_meridim_dma, MSG_BUFF + 4);
      // delayMicroseconds(10);
      spi_ready_flag = false;
    }
  }

  // [check!] ここがTeensyをマスターとして実施されるSPI通信の完了を待つ待機ループになる

  // @[1-2] SPI通信で受信したデータについての処理（工程[6]まで一気に行う）
  while (slave.available()) // SPI受信を完了したデータについての作業はこのwhileの中で行う
  {
    memcpy(r_spi_meridim.bval, r_spi_meridim_dma, MSG_BUFF + 4); // DMAのSPI受信データをSPI受信配列に転記 ★★★
    slave.pop();                                                 // DMAのデータ配列の先頭を削除

    //------------------------------------------------------------------------
    // [ 1.5 ]  S P I 受 信 デ ー タ の チェックサム と 待受モード 対 応
    //------------------------------------------------------------------------
    // チェックサムがOKならSPI受信配列からUDP送信配列に転記 ★★★
    if (checksum_rslt(r_spi_meridim.sval, MSG_SIZE))
    {
      for (int i = 0; i < MSG_SIZE; i++)
      {
        s_udp_meridim.sval[i] = r_spi_meridim.sval[i];
      }

      spi_ok++;
      s_udp_meridim.bval[MSG_ERR_u] &= B11101111; //エラーフラグ12番(ESPのTeensyからのSPI受信エラー検出)をオフ

      // SPI送信タイミング「待受モード」のコマンドチェック. ★★★
      if (s_udp_meridim.sval[0] == 5) //　5ならフラグ下げ. Teensy主導
      {
        flag_spi_initiative_outer = false;
      }
      else if (s_udp_meridim.sval[0] == 6) // 6 ならフラグ上げ. 外部主導
      {
        flag_spi_initiative_outer = true;
      }
    }
    else
    {
      s_udp_meridim.bval[MSG_ERR_u] |= B00010000; //エラーフラグ12番(ESPのTeensyからのSPI受信エラー検出)をオン
    }

    // @[1-3-1b] シーケンシャルカウンタのデータ格納 ★★★
    frame_sync_spi_r_resv = s_udp_meridim.sval[1]; // ★★★

    //------------------------------------------------------------------------
    // [ 2 ]  U D P 送 信 デ ー タ 作 成
    //------------------------------------------------------------------------
    flow_monitor("[2]"); // 動作チェック用シリアル表示

    // → ここでチェックサムを行ってもよい.

    // チェックサムを計算して格納 ★★★
    s_udp_meridim.sval[MSG_SIZE - 1] = checksum_val(s_udp_meridim.sval, MSG_SIZE); //★★★

    // → Teensyからのリモコン値はここでのみ補足可能.
    // → 今回は特になにもなし.

    //------------------------------------------------------------------------
    // [ 3 ]  U D P 送 信 実 行
    //------------------------------------------------------------------------
    flow_monitor("[3]"); // 動作チェック用シリアル表示

    // 待受モード対応. 待受モードかつシーケンシャルカウンタが上がっていない時はUDP送信をキャンセル
    if ((flag_spi_initiative_outer == false) or (frame_sync_spi_r_resv != frame_sync_spi_r_last)) //★★★ シーケンシャルカウンタを比較
    {
      udp_busy_flag = true; // UDP使用中のフラグをアゲる
      // @[3-1] SPI送受信の実行
      sendUDP(); // UDP送信を実行
      // delayMicroseconds(1);
    }

