Ninagawa123/Meridian_Dev/machiuke_mode_esp32/old/main.cpp
    frame_sync_spi_r_last = frame_sync_spi_r_resv; //前回受信したシーケンシャル番号をキープ

    //------------------------------------------------------------------------
    // [ 4 ]  U D P 受 信 待 受 ル ー プ
    //------------------------------------------------------------------------
    flow_monitor("[4]"); // 動作チェック用シリアル表示

    //[4-1] UDP受信の待受
    udp_rsvd_flag = false;
    udp_resv_timeout = 0;
    while (!udp_rsvd_flag) // データの受信バッファ確認
    {
      short udp_packet = udp.parsePacket();
      if (udp_packet >= MSG_BUFF)
      {
        // Serial.print(udp_packet);
        udp.read(r_udp_meridim.bval, MSG_BUFF); // データの受信
        udp_rsvd_flag = true;
        flow_monitor("!"); // 動作チェック用シリアル表示
        // Serial.println(r_udp_meridim.sval[1]); // ★このシーケンシャルカウンタは動作OK??
      }
      if (udp_resv_timeout > UDP_TIMEOUT) // UDPの受信待ちのタイムアウト
      {
        flow_monitor("*UdpResvTimeOut"); // 動作チェック用シリアル表示
        break;
      }
      udp_resv_timeout++;
      delay(1);
    }
    udp_busy_flag = false; // UDP使用中のフラグをサゲる

    //------------------------------------------------------------------------
    // [ 5 ]  U D P 受 信 品 質 チ ェ ッ ク
    //------------------------------------------------------------------------
    flow_monitor("[5]"); // 動作チェック用シリアル表示

    // @[5-1] UDP受信データ r_udp_meridim のチェックサムを確認.
    if (checksum_rslt(r_udp_meridim.sval, MSG_SIZE))
    {
      // @[5-2a] 受信成功ならUDP受信データをSPI送信データに上書き更新する.
      memcpy(s_spi_meridim.bval, r_udp_meridim.bval, MSG_BUFF + 4);
      s_spi_meridim.bval[MSG_ERR_u] &= 0b10111111; // meridimの[MSG_ERR]番の14ビット目(ESPのUDP受信成否)のフラグをサゲる.
    }
    else
    {
      // @[5-2b] 受信失敗なら今回の受信データを使わず、前回のSPI送信データにエラーフラグだけ上乗せする.
      s_spi_meridim.bval[MSG_ERR_u] |= 0b01000000; // meridimの[MSG_ERR]番の14ビット目(ESPのUDP受信成否)のフラグをアゲる.
    }

    // @[5-3] 連番スキップ検出

    // @[5-3-1] シーケンシャルカウンタ予想値の生成
    frame_sync_r_expect++;           // フレームカウント予想値を加算
    if (frame_sync_r_expect > 29999) // 予想値が29,999以上ならカウントを-30000に戻す
    {
      frame_sync_r_expect = -30000;
    }

    // @[5-3-2] シーケンシャルカウンタチェック
    if (frame_sync_r_expect == s_spi_meridim.sval[1]) // 受信シーケンシャルカウンタの値が予想通りなら,
    {
      s_spi_meridim.bval[MSG_ERR_u] &= 0b11111011; // エラーフラグ10番(ESP受信のスキップ検出)をサゲる.
    }
    else // 受信シーケンシャルカウンタの値が予想と違ったら,
    {
      frame_sync_r_expect = s_spi_meridim.sval[1]; // 現在の受信値を予想結果としてキープ
      s_spi_meridim.bval[MSG_ERR_u] |= 0b00000100; // エラーフラグ10番(ESP受信のスキップ検出)をアゲる.
    }
    // [check!] ここで s_spi_meridim にはチェック済みの r_udp_meridim が転記され, ESP32UDP受信エラーフラグも入った状態.

    //------------------------------------------------------------------------
    // [ 6 ]  S P I 送 信 デ ー タ 作 成
    //------------------------------------------------------------------------
    flow_monitor("[6]\n"); // 動作チェック用シリアル表示

    // @[6-1] ユーザー定義の送信データの書き込み
    // Teensyへ送るデータをこのパートで作成, 書き込み.
    // → 今回はとくに何もしない.

    // @[6-2] リモコンデータの書き込み
    s_spi_meridim.sval[15] = r_udp_meridim.sval[15] | pad_btn;
    s_spi_meridim.sval[16] = r_udp_meridim.sval[16] | pad_stick_L;
    s_spi_meridim.sval[17] = r_udp_meridim.sval[17] | pad_stick_R;
    s_spi_meridim.sval[18] = r_udp_meridim.sval[18] | pad_stick_V;

    // @[6-3] フレームスキップ検出用のカウントを転記して格納（PCからのカウントと同じ値をESPに転送）
    // → すでにPCから受け取った値がs_spi_meridim.sval[1]に入っているのでここでは何もしない.

    // @[6-4] チェックサムの追記
    s_spi_meridim.sval[MSG_SIZE - 1] = checksum_val(s_spi_meridim.sval, MSG_SIZE);
    // [check!] ここでSPI送信データ s_spi_meridim はチェックサムが入り完成している状態.

    // @[6-5] 完成したSPI送信データをDMAに転記
    memcpy(s_spi_meridim_dma, s_spi_meridim.bval, MSG_BUFF + 4);
    spi_ready_flag = true; // SPI送信の順番制御用
    // [check!] 次回のSPI送受信に備え、DMAにデータが格納された状態.
  }
}
